Revit 2024 API
StructuralSettings.GetStructuralSettings Method
 Obtains the StructuralSettings object for the specified project document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static StructuralSettings GetStructuralSettings(
	Document doc
)
Visual Basic
Public Shared Function GetStructuralSettings ( _
	doc As Document _
) As StructuralSettings
Visual C++
public:
static StructuralSettings^ GetStructuralSettings(
	Document^ doc
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 A project document.
Return Value
 The StructuralSettings object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace